#### MassGBXMLExportOptions Class

---

|  |
| --- |
| Members   See Also |

Options used when exporting a gbXML file from a mass model document.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'GBXMLExportOptions' class instead.")] public class MassGBXMLExportOptions : IDisposable ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'GBXMLExportOptions' class instead.")> _ Public Class MassGBXMLExportOptions _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'GBXMLExportOptions' class instead.")] public ref class MassGBXMLExportOptions : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Analysis MassGBXMLExportOptions

# See Also

MassGBXMLExportOptions Members

Autodesk.Revit.DB.Analysis Namespace